var Cookies2 = Cookies.noConflict();
var cookies = Cookies2.get();
var url = window.location.origin + '/privacy/policy';
$('body').ihavecookies({
	title: "ยอมรับคุกกี้และนโยบายความเป็นส่วนตัว ?",
	message: "กองโรคจากการประกอบอาชีพและสิ่งแวดล้อม กรมควบคุมโรค กระทรวงสาธารณสุข ใช้ข้อมูลคุกกี้ในกิจกรรมต่างๆ ของกองโรคจากการประกอบอาชีพและสิ่งแวดล้อม เพื่อพัฒนาประสิทธิภาพและปรับปรุงคุณภาพการการให้บริการของกองโรคจากการประกอบอาชีพและสิ่งแวดล้อม&nbsp;",
	link: url,
	moreInfoLabel: 'อ่านเพิ่มเติม',
	acceptBtnLabel: 'ยอมรับ',
	advancedBtnLabel: 'ตั้งค่า',
	closeBtnLabel: 'ปิดชั่วคราว',
	fixedCookieTypeLabel: 'คุกกี้ที่มีความจำเป็น (Strictly Necessary Cookies)',
	fixedCookieTypeDesc: 'คุกกี้ประเภทนี้มีความจำเป็นต่อการให้บริการเว็บไซต์ของกองโรคจากการประกอบอาชีพและสิ่งแวดล้อม เพื่อให้ท่านสามารถเข้าใช้งานในส่วนต่างๆ ของเว็บไซต์ได้ รวมถึงช่วยจดจำข้อมูลที่ท่านเคยให้ไว้ผ่านเว็บไซต์ การปิดการใช้งานคุกกี้ประเภทนี้จะส่งผลให้ท่านไม่สามารถใช้บริการในสาระสำคัญของกองโรคจากการประกอบอาชีพและสิ่งแวดล้อม ซึ่งจำเป็นต้องเรียกใช้คุกกี้ได้',
	cookieTypesTitle: 'คุกกี้ที่เราใช้',
	cookieTypes: [{
		type: 'คุกกี้เพื่อการวิเคราะห์และประเมินผลการใช้งาน (Performance Cookies)',
		value: 'analytics',
		description: 'คุกกี้ประเภทนี้ช่วยให้กองโรคจากการประกอบอาชีพและสิ่งแวดล้อม ทราบถึงการปฏิสัมพันธ์ของผู้ใช้งานในการใช้บริการเว็บไซต์ของกองโรคจากการประกอบอาชีพและสิ่งแวดล้อม รวมถึงหน้าเพจหรือพื้นที่ใดของเว็บไซต์ที่ได้รับความนิยม ตลอดจนการวิเคราะห์ข้อมูลด้านอื่นๆ ยังใช้ข้อมูลนี้เพื่อการปรับปรุงการทำงานของเว็บไซต์ และเพื่อเข้าใจพฤติกรรมของผู้ใช้งานมากขึ้น ถึงแม้ว่า ข้อมูลที่คุกกี้นี้เก็บรวบรวมจะเป็นข้อมูลที่ไม่สามารถระบุตัวตนได้ และนำมาใช้วิเคราะห์ทางสถิติเท่านั้น การปิดการใช้งานคุกกี้ประเภทนี้จะส่งผลให้ ไม่สามารถทราบปริมาณผู้เข้าเยี่ยมชมเว็บไซต์ และไม่สามารถประเมินคุณภาพการให้บริการได้'
	}],
	onAccept: function() {return;} /*location.href = 'https://doeservice.moph.go.th'; */
});
if ($.fn.ihavecookies.preference('analytics') !== true) {
	if ('' !== cookies) {
		setTimeout(function() {
			Cookies2.remove('_ga', {
				path: '/',
				domain: '.moph.go.th'
			});
			Cookies2.remove('_gid', {
				path: '/',
				domain: '.moph.go.th'
			});
			Cookies2.remove('_gat', {
				path: '/',
				domain: '.moph.go.th'
			});
		}, 1500);
	}
}
