@extends('layouts.guest.index')
@section('style')
<style type="text/css">
	.privacy-warpper{font-size:1em;margin-bottom: 20px}
	.privacy-warpper h1{font-size:1.10em;font-weight: 600}
	.privacy-warpper ol>li{padding:10px 0}
	.privacy-warpper p{padding:10px 0;text-indent:30px}
	ol{list-style-type:decimal}
</style>
@endsection
@section('content')
<div class="row bg-white font-prompt">
	<div class="col-12">
		<article>
			<div class="text-center mx-auto"">
				<hgroup>
					<h5 class="section-title bg-white text-center text-success px-3">นโยบายการคุ้มครองข้อมูลส่วนบุคคลของ กรมควบคุมโรค</h5>
					<h6>Privacy Policy of Ministry of public health</h6>
				</hgroup>
				<p>จัดทำเมื่อวันที่ 1 มิถุนายน 2556</p>
			</div>
			<div class="card-body card-block">
				<section class="privacy-warpper">
					<h1>การเก็บรวบรวมข้อมูลส่วนบุคคล</h1>
					<ol>
						<li>เพื่อความสะดวกในการให้บริการแก่ผู้ใช้บริการทุกท่านที่เข้ามาใช้บริการเว็บไซต์ของกรมควบคุมโรค ทางเว็บไซต์จึงได้จัดเก็บรวบรวมข้อมูลส่วนบุคคลของท่านไว้ เช่น อีเมล์แอดเดรส (Email Address) ชื่อ (Name) ที่อยู่หรือที่ทำงาน (Home or Work Address) เขตไปรษณีย์ (ZIP Code) หรือหมายเลขโทรศัพท์ (Telephone Number) เป็นต้น</li>
						<li>ในกรณีที่ท่านสมัคร (Sign Up) เพื่อสมัครสมาชิกหรือเพื่อใช้บริการอย่างใดอย่างหนึ่ง กรมควบคุมโรค จะเก็บรวบรวมข้อมูลส่วนบุคคลของท่านเพิ่มเติม ได้แก่ เพศ (Sex) อายุ (Gender) สิ่งที่โปรดปราน/ความชอบ (Preferences/Favorites) ความสนใจ (Interests) หรือหมายเลขบัตรเครดิต (CreditCard Number) และที่อยู่ในการแจ้งค่าใช้จ่าย (Billing Address)</li>
						<li>นอกจากนั้น เพื่อสำรวจความนิยมในการใช้บริการ อันจะเป็นประโยชน์ในการนำสถิติไปใช้ในการปรับปรุงคุณภาพในการให้บริการของกรมควบคุมโรค จึงจำเป็นต้องจัดเก็บรวบรวมข้อมูลของท่านบางอย่างเพิ่มเติม ได้แก่ หมายเลขไอพี (IP Address) ชนิดของโปรแกรม ค้นผ่าน (Browser Type) โดเมนเนม (Domain Name) บันทึกหน้าเว็บ (web page) ของเว็บไซต์ที่ผู้ใช้เยี่ยมชม เวลาที่เยี่ยมชมเว็บไซต์ (Access Times) และเว็บไซต์ที่ผู้ใช้บริการเข้าถึงก่อนหน้านั้น (Referring Website Addresses)</li>
						<li>กรมควบคุมโรค ขอแนะนำให้ท่านตรวจสอบนโยบายการคุ้มครองข้อมูลส่วนบุคคล (PrivacyPolicy) ของเว็บไซต์อื่นที่เชื่อมโยงจากเว็บไซต์นี้ เพื่อจะได้ทราบและเข้าใจว่าเว็บไซต์ดังกล่าวเก็บรวบรวม ใช้ หรือดำเนินการเกี่ยวกับข้อมูลส่วนบุคคลของท่านอย่างไร ทั้งนี้ กรมควบคุมโรคไม่สามารถรับรอง ข้อความ หรือรับรองการดำเนินการใดๆ ตามที่ได้มีการประกาศไว้ในเว็บไซต์ดังกล่าวได้ และไม่ขอรับผิดชอบใดๆ หากเว็บไซต์เหล่านั้นไม่ได้ปฏิบัติการหรือดำเนินการใดๆ ตามนโยบายการคุ้มครองข้อมูลส่วนบุคคลที่ เว็บไซต์ดังกล่าวได้ประกาศไว้</li>
					</ol>
				</section>
				<section class="privacy-warpper">
					<h1>การใช้ข้อมูลส่วนบุคคล</h1>
					<ol>
						<li>กรมควบคุมโรค จะใช้ข้อมูลส่วนบุคคลของท่านเพียงเท่าที่จำเป็น เช่น ชื่อ และ ที่อยู่ เพื่อใช้ในการติดต่อ ให้บริการประชาสัมพันธ์ หรือให้ข้อมูลข่าวสารต่างๆ รวมทั้งสำรวจความคิดเห็นของท่านในกิจการหรือกิจกรรมของ กรมควบคุมโรค เท่านั้น</li>
						<li>กรมควบคุมโรค ขอรับรองว่าจะไม่นำข้อมูลส่วนบุคคลของท่านที่ กรมควบคุมโรค ได้เก็บรวบรวมไว้ ไปขายหรือเผยแพร่ให้กับบุคคลภายนอกโดยเด็ดขาด เว้นแต่จะได้รับอนุญาตจากท่านเท่านั้น</li>
						<li>ในกรณีที่ กรมควบคุมโรค ได้ว่าจ้างหน่วยงานอื่นเพื่อให้ดำเนินการเกี่ยวกับข้อมูลส่วนบุคคลของท่าน เช่น การจัดส่งพัสดุไปรษณีย์ การวิเคราะห์เชิงสถิติในกิจการหรือกิจกรรมของ กรมควบคุมโรค เป็นต้น กรมควบคุมโรค จะกำหนดให้หน่วยงานที่ได้ว่าจ้างให้ดำเนินการดังกล่าว เก็บรักษาความลับ และความปลอดภัยของข้อมูลส่วนบุคคลของท่าน และกำหนดข้อห้ามมิให้มีการนำข้อมูลส่วนบุคคลดังกล่าว ไปใช้นอกเหนือจากกิจกรรมหรือกิจการของ กรมควบคุมโรค</li>
					</ol>
				</section>
				<section class="privacy-warpper">
					<h1>สิทธิในการควบคุมข้อมูลส่วนบุคคลของท่าน</h1>
					<p>เพื่อประโยชน์ในการรักษาความเป็นส่วนตัวของท่านๆ มีสิทธิเลือกที่จะให้มีการใช้หรือแชร์ข้อมูลส่วนบุคคลของท่าน หรืออาจเลือกที่จะไม่รับข้อมูลหรือสื่อทางการตลาดใดๆ จาก กรมควบคุมโรค ก็ได้ โดยเพียงแต่ท่านกรอกความจำนงดังกล่าวเพื่อแจ้งให้ กรมควบคุมโรค ทราบในหน้าเว็บ ddc.moph.go.th</p>
				</section>
				<section class="privacy-warpper">
					<h1>การรักษาความปลอดภัยสำหรับข้อมูลส่วนบุคคล</h1>
					<p>เพื่อประโยชน์ในการรักษาความลับและความปลอดภัยสำหรับข้อมูลส่วนบุคคลของท่าน กรมควบคุมโรค จึงได้กำหนดระเบียบภายในหน่วยงานเพื่อกำหนดสิทธิในการเข้าถึงหรือใช้ข้อมูลส่วนบุคคลของท่าน และเพื่อรักษาความลับและความปลอดภัยของข้อมูลบางอย่างที่มีความสำคัญอย่างยิ่ง เช่น หมายเลขบัตรเครดิต เป็นต้น กรมควบคุมโรค จึงได้จัดให้มีช่องทางการสื่อสารแบบปลอดภัยสำหรับข้อมูลดังกล่าวด้วยการเข้ารหัสลับข้อมูลดังกล่าว เช่น จัดให้มีการใช้ Secure Socket Layer (SSL) protocol เป็นต้น</p>
				</section>
				<section class="privacy-warpper">
					<h1>การใช้คุกกี้ (Cookies)</h1>
					<p>“คุกกี้” คือ ข้อมูลที่ กรมควบคุมโรค ส่งไปยังโปรแกรมค้นผ่านเว็บไซต์ (Web browser) ของผู้ใช้บริการ และเมื่อมีการติดตั้งข้อมูลดังกล่าวไว้ในระบบของท่านแล้ว หากมีการใช้ “คุกกี้” ก็จะทำให้เว็บไซต์ http://ddc.moph.go.th สามารถบันทึกหรือจดจำข้อมูลของผู้ใช้บริการไว้ จนกว่าผู้ใช้บริการจะออกจากโปรแกรมค้นผ่านเว็บไซต์ หรือจนกว่าผู้ใช้บริการจะทำการลบ “คุกกี้” นั้นเสีย หรือไม่อนุญาตให้ “คุกกี้” นั้น ทำงานอีกต่อไป
					หากท่านเลือกใช้ “คุกกี้” แล้ว ท่านจะได้รับความสะดวกสบายในการท่องเว็บไซต์มากขึ้น เพราะ “คุกกี้” จะช่วยจดจำเว็บไซต์ที่ท่านแวะหรือเยี่ยมชม ทั้งนี้ กรมควบคุมโรค จะนำข้อมูลที่ “คุกกี้” ได้บันทึกหรือเก็บรวบรวมไว้ ไปใช้ในการวิเคราะห์เชิงสถิติ หรือในกิจกรรมอื่นของ กรมควบคุมโรค เพื่อ ปรับปรุงคุณภาพการให้บริการของ กรมควบคุมโรค ต่อไป</p>
				</section>
				<section class="privacy-warpper">
					<h1>การปรับปรุงนโยบายการคุ้มครองข้อมูลส่วนบุคคล</h1>
					<p>   กรมควบคุมโรค อาจทำการปรับปรุงหรือแก้ไขนโยบายการคุ้มครองข้อมูลส่วนบุคคลโดยมิได้แจ้งให้ท่านทราบล่วงหน้า ทั้งนี้ เพื่อความเหมาะสมและมีประสิทธิภาพในการให้บริการ ดังนั้น กรมควบคุมโรค จึงขอแนะนำให้ผู้ใช้บริการอ่านนโยบายการคุ้มครองข้อมูลส่วนบุคคลทุกครั้งที่เยี่ยมชม หรือมีการใช้บริการจากเว็บไซต์ของกรมควบคุมโรค</p>
				</section>
				<section class="privacy-warpper">
					<h1>การปฏิบัติตามนโยบายคุ้มครองข้อมูลส่วนบุคคลและการติดต่อกับ กรมควบคุมโรค</h1>
					<p>   ในกรณีที่ท่านมีข้อสงสัย ข้อเสนอแนะ หรือข้อติชมใดๆ เกี่ยวกับนโยบายการคุ้มครองข้อมูลส่วนบุคคล หรือการปฏิบัติตามนโยบายการคุ้มครองข้อมูลส่วนบุคคลฉบับนี้ กรมควบคุมโรค ยินดีที่จะตอบข้อสงสัย รับฟังข้อเสนอแนะ และคำติชมทั้งหลาย อันจะเป็นประโยชน์ต่อการปรับปรุงการให้บริการของกรมควบคุมโรคต่อไป โดยท่านสามารถติดต่อกับ กรมควบคุมโรค ตามที่อยู่ที่ปรากฏข้างล่างนี้</p>
				</section>
			</div>
		</article>
	</div>
</div>
@endsection


